#pragma once
#include <opencv2/opencv.hpp>

class OpenCVBase
{
public:
	/// <summary>------------------------------------///
	///					コンストラクタ				 ///
	/// ---------------------------------------</summary>

	OpenCVBase();

	/// <summary>------------------------------------///
	///					デストラクタ				 ///
	/// ---------------------------------------</summary>

	~OpenCVBase();

	/// <summary>------------------------------------///
	///					カメラをオープン			 ///
	/// ---------------------------------------</summary>

	bool OpenCameta();

	/// <summary>------------------------------------///
	///					ウィンドウ生成				 ///
	/// ---------------------------------------</summary>

	void Createwindow();

	/// <summary>------------------------------------///
	///					コンストラクタ				 ///
	/// ---------------------------------------</summary>

	bool LoadCascade();

	/// <summary>------------------------------------///
	///					顔検出開始					 ///
	/// ---------------------------------------</summary>

	void FaceDetectionStart();

private:
	/// <summary>------------------------------------///
	/// m_cap		->カメラ格納用					 ///
	/// m_cascade	->カスケード分類器格納用		 ///
	/// m_faces		->顔							 ///
	/// --------------------------------------</summary>
	cv::VideoCapture m_cap;
	cv::CascadeClassifier m_cascade;
	std::vector<cv::Rect> m_faces;
};